app/Models/AdminModel.php

    public function verifyLogin(string $username, string $password): ?array
    {
        $admin = $this->where('username', $username)->first();

        if (!$admin || !password_verify($password, $admin['password_hash'])) {
            return null;
        }

        if (password_needs_rehash($admin['password_hash'], PASSWORD_DEFAULT)) {
            $this->update($admin['id'], ['password_hash' => password_hash($password, PASSWORD_DEFAULT)]);
        }
        $this->update($admin['id'], ['last_login_at' => date('Y-m-d H:i:s')]);
---
SELECT *
FROM `admins`
WHERE `username` = 'admin'
 LIMIT 1
UPDATE `admins` SET `last_login_at` = '2026-09-29 15:16:47'
WHERE `admins`.`id` IN ('1')