app/Models/QuizModel.php

SELECT COUNT(*) AS total, AVG(score) AS avg_score, MAX(score) AS high_score
FROM `quiz_results`
SELECT *
FROM `quiz_results`
ORDER BY `id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `questions`
WHERE `active` = 1
---
    public function getStats(): array
    {
        $agg = $this->db->table('quiz_results')
            ->select('COUNT(*) AS total, AVG(score) AS avg_score, MAX(score) AS high_score')
            ->get()->getRow();
        $recent = $this->db->table('quiz_results')->orderBy('id', 'DESC')->limit(5)->get()->getResultArray();

        return [
            'total_questions'  => $this->db->table('questions')->countAllResults(),
            'active_questions' => $this->db->table('questions')->where('active', 1)->countAllResults(),

SELECT *
FROM `settings`
---
    public function getSettings(): array
    {
        $settings = [];
        foreach ($this->db->table('settings')->get()->getResultArray() as $row) {

SELECT *
FROM `questions`
WHERE `active` = 1
ORDER BY `sort`, `id`
---
    private function fetchQuestions(bool $activeOnly): array
    {
        $builder = $this->db->table('questions')->orderBy('sort')->orderBy('id');
        if ($activeOnly) {
            $builder->where('active', 1);
        }
        $rows = $builder->get()->getResultArray();

SELECT *
FROM `question_options`
WHERE `question_id` IN ('1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16')
ORDER BY `question_id`, `sort`, `id`
---
    private function fetchOptions(array $questionIds): array
    {
        $rows = $this->db->table('question_options')
            ->whereIn('question_id', $questionIds)
            ->orderBy('question_id')->orderBy('sort')->orderBy('id')
            ->get()->getResultArray();